{
  "class_name": "Model",
  "config": {
    "name": "model_2",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [ null, 4 ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_3"
        },
        "name": "input_3",
        "inbound_nodes": []
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "dtype": "float32",
          "units": 30,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_4",
        "inbound_nodes": [
          [
            [
              "input_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_5",
          "trainable": true,
          "dtype": "float32",
          "units": 77,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_5",
        "inbound_nodes": [
          [
            [
              "dense_4",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [ [ "input_3", 0, 0 ] ],
    "output_layers": [ [ "dense_5", 0, 0 ] ]
  },
  "keras_version": "2.3.0-tf",
  "backend": "tensorflow"
}